public class Task8 {
    public static void main(String[] args) {

        int clientOS = 1;
        System.out.println(clientOS == 0 ? "Установите версию приложения для iOS по ссылке":
                "Установите версию приложения для Android по ссылке");

    }
}


/*

Задача 8: Рекомендация мобильного приложения
        Напишите программу, которая:

Объявляет переменную clientOS (0-iOS, 1-Android)

Рекомендует соответствующее приложение

Выводит сообщение:
        "Установите версию приложения для [iOS/Android] по ссылке"*/
